In [29]:
import numpy as np
import pandas as pd
heroes_information = pd.read_csv("heroes_information.csv")

In [30]:
###instalar desde anaconda navigator######
####pandasql
####mysql
####mysql-connector-c
####mysql-connector-python
from pandasql import *

In [31]:
####para enlistar los documentos en el directorio#####
os.listdir()

['SQL Competition.ipynb',
 '.DS_Store',
 'heroes_information.csv',
 '.ipynb_checkpoints']

In [32]:
pysqldf = lambda q: sqldf(q,globals())

In [33]:
query2 = " SELECT * FROM heroes_information limit 10"

In [34]:
pysqldf(query2)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

In [35]:
query1 = """
SELECT *
FROM heroes_information
WHERE Race='Human'
AND Height > 200;

"""

In [36]:
pysqldf(query1)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,29,Ant-Man,Male,blue,Human,Blond,211.0,Marvel Comics,None,good,122.0
2,59,Bane,Male,None,Human,None,203.0,DC Comics,None,bad,180.0
3,119,Bloodaxe,Female,blue,Human,Brown,218.0,Marvel Comics,None,bad,495.0
4,221,Doctor Doom,Male,brown,Human,Brown,201.0,Marvel Comics,None,bad,187.0
5,373,Juggernaut,Male,blue,Human,Red,287.0,Marvel Comics,None,neutral,855.0
6,391,Kingpin,Male,blue,Human,No Hair,201.0,Marvel Comics,None,bad,203.0
7,412,Lizard,Male,red,Human,No Hair,203.0,Marvel Comics,None,bad,230.0
8,476,Mr Incredible,Male,blue,Human,Blond,201.0,Dark Horse Comics,None,good,158.0
9,557,Rey,Female,hazel,Human,Brown,297.0,George Lucas,None,good,-99.0
10,583,Scorpion,Male,brown,Human,Brown,211.0,Marvel Comics,None,bad,310.0
11,591,She-Hulk,Female,green,Human,Green,201.0,Marvel Comics,None,good,315.0

In [37]:
p1 = """
SELECT name
FROM heroes_information
ORDER BY id
LIMIT 1;

"""

In [38]:
pysqldf(p1)

     name
0  A-Bomb

In [39]:
p2 = """
SELECT COUNT(DISTINCT Publisher)
FROM heroes_information;
"""

In [40]:
pysqldf(p2)

   COUNT(DISTINCT Publisher)
0                         24

In [41]:
p3 = """
SELECT COUNT(*)
FROM heroes_information
WHERE Height > 200;

"""

In [42]:
pysqldf(p3)

   COUNT(*)
0        59

In [43]:
p4 = """
SELECT COUNT(*)
FROM heroes_information
WHERE Race = 'Human' 
AND Height > 200;
"""

In [44]:
pysqldf(p4)

   COUNT(*)
0        12

In [45]:
p5 = """
SELECT COUNT(*)
FROM heroes_information
WHERE Weight > 100 
AND Weight < 200;
"""

In [46]:
pysqldf(p5)

   COUNT(*)
0        98

In [47]:
p6 = """
SELECT COUNT(*)
FROM heroes_information
WHERE "Eye color" IN ('blue', 'red');
"""

In [48]:
pysqldf(p6)

   COUNT(*)
0       271

In [49]:
p7 = """
SELECT COUNT(*)
FROM heroes_information
WHERE (Race = 'Human' AND Race = 'Mutant' AND "Hair color" = 'Green') 
OR (Race = 'Vampire' AND "Hair color" = 'Black');

"""

In [50]:
pysqldf(p7)

   COUNT(*)
0         1

In [51]:
p8 = """
SELECT name
FROM heroes_information
ORDER BY Race DESC
LIMIT 1;
"""

In [52]:
pysqldf(p8)

             name
0  Solomon Grundy

In [53]:
p9 = """
SELECT Gender, COUNT(*)
FROM heroes_information
GROUP BY Gender;
"""

In [54]:
pysqldf(p9)

   Gender  COUNT(*)
0    None        29
1  Female       200
2    Male       505

In [55]:
p10 = """
SELECT Publisher, COUNT(*)
FROM heroes_information
GROUP BY Publisher
HAVING COUNT(*) > 15;
"""

In [56]:
pysqldf(p10)

           Publisher  COUNT(*)
0          DC Comics       215
1  Dark Horse Comics        18
2      Marvel Comics       388
3       NBC - Heroes        19